-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\UofT\Y2 Winter\ECO375\A1\ECO375_A1.log
  log type:  text
 opened on:  23 Feb 2021, 23:51:11

. set more off

. clear

. use "Assignment01_Data.dta", clear

. datasignature
  198:11(30960):747273576:2793224515

. 
. 
. twoway (scatter cases_log week, sort) (scatter lagvacc_per week, sort yaxis(2)) (lfit cases_log week) (lfit lagvacc_per week, yaxis(2)) if week>tw(2020w48), yscale(r
> ange(0 10)) ylabel(#10) title (COVID-19 Cases and Vaccination)

. 
. twoway (scatter cases_log age, sort xlabel(,valuelabel) msize(0.02in)), yscale(range(3 10)) ylabel(#10) title(COVID-19 Cases by Age Group, size(12pt))

. 
. 
. summarize week age cases_rate cases_log lagvacc_per lagvacc_per2 lagvacc_0 lagvacc_0_10 lagvacc_10_20 lagvacc_20_100

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        week |        198      3164.5    6.360371       3154       3175
         age |        198           4    2.588534          0          8
  cases_rate |        198    2598.147    2065.757   262.2702   9049.648
   cases_log |        198    7.343567    1.104857   4.691348   9.657331
 lagvacc_per |        198    4.433254    15.22428          0    86.4881
-------------+---------------------------------------------------------
lagvacc_per2 |        198    250.2618     1094.51          0   7480.191
   lagvacc_0 |        198    .8383838    .3690314          0          1
lagvacc_0_10 |        198    .0606061    .2392111          0          1
lagvacc_1~20 |        198    .0353535    .1851399          0          1
lagvacc_~100 |        198    .0656566    .2483086          0          1

. 
. count if lagvacc_0 == 1
  166

. count if lagvacc_0_10 == 1
  12

. count if lagvacc_10_20 == 1
  7

. count if lagvacc_20_100 == 1
  13

. 
. reg cases_log lagvacc_per

      Source |       SS           df       MS      Number of obs   =       198
-------------+----------------------------------   F(1, 196)       =      0.76
       Model |   .93144025         1   .93144025   Prob > F        =    0.3837
    Residual |  239.548308       196  1.22218525   R-squared       =    0.0039
-------------+----------------------------------   Adj R-squared   =   -0.0012
       Total |  240.479749       197  1.22070938   Root MSE        =    1.1055

------------------------------------------------------------------------------
   cases_log |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 lagvacc_per |   .0045166   .0051737     0.87   0.384    -.0056866    .0147198
       _cons |   7.323544   .0818457    89.48   0.000     7.162133    7.484955
------------------------------------------------------------------------------

. 
. reg cases_log lagvacc_per i.age i.week 

      Source |       SS           df       MS      Number of obs   =       198
-------------+----------------------------------   F(30, 167)      =    373.71
       Model |  236.950247        30  7.89834158   Prob > F        =    0.0000
    Residual |  3.52950134       167  .021134739   R-squared       =    0.9853
-------------+----------------------------------   Adj R-squared   =    0.9827
       Total |  240.479749       197  1.22070938   Root MSE        =    .14538

------------------------------------------------------------------------------
   cases_log |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 lagvacc_per |  -.0057974   .0010479    -5.53   0.000    -.0078663   -.0037285
             |
         age |
      15-19  |  -.4400148    .043834   -10.04   0.000    -.5265551   -.3534745
      20-29  |  -.0302479   .0438458    -0.69   0.491    -.1168114    .0563156
      30-39  |  -.3023669   .0438638    -6.89   0.000    -.3889659   -.2157678
      40-49  |  -.3980066   .0439233    -9.06   0.000     -.484723   -.3112901
      50-59  |  -.6554999   .0440983   -14.86   0.000     -.742562   -.5684378
      60-69  |  -1.015151   .0447388   -22.69   0.000    -1.103478   -.9268251
      70-79  |   -1.65868   .0453784   -36.55   0.000    -1.748269    -1.56909
        80+  |  -2.042018   .0450697   -45.31   0.000    -2.130998   -1.953038
             |
        week |
       3155  |   .3871146   .0685318     5.65   0.000     .2518143     .522415
       3156  |   .6999702   .0685318    10.21   0.000     .5646698    .8352705
       3157  |   1.017811   .0685318    14.85   0.000     .8825106    1.153111
       3158  |   .9974344   .0685318    14.55   0.000      .862134    1.132735
       3159  |   .6502206   .0685318     9.49   0.000     .5149202    .7855209
       3160  |  -.1001395   .0685318    -1.46   0.146    -.2354399    .0351608
       3161  |  -.7260257   .0685318   -10.59   0.000     -.861326   -.5907253
       3162  |  -1.147822   .0685318   -16.75   0.000    -1.283122   -1.012522
       3163  |  -1.164281   .0685318   -16.99   0.000    -1.299581    -1.02898
       3164  |  -1.148024   .0685318   -16.75   0.000    -1.283325   -1.012724
       3165  |  -1.058696   .0685318   -15.45   0.000    -1.193996   -.9233953
       3166  |  -.8599854   .0685318   -12.55   0.000    -.9952858    -.724685
       3167  |  -.4608992   .0685318    -6.73   0.000    -.5961996   -.3255989
       3168  |  -.1961716   .0685318    -2.86   0.005     -.331472   -.0608712
       3169  |   .1670387   .0685318     2.44   0.016     .0317383    .3023391
       3170  |   .5429636   .0685318     7.92   0.000     .4076632    .6782639
       3171  |   .8499198   .0685318    12.40   0.000     .7146195    .9852202
       3172  |   1.205299   .0687719    17.53   0.000     1.069524    1.341073
       3173  |    1.41814   .0720875    19.67   0.000      1.27582     1.56046
       3174  |   1.309996   .0770791    17.00   0.000     1.157821    1.462171
       3175  |   1.200086    .078765    15.24   0.000     1.044582    1.355589
             |
       _cons |   7.933249   .0567787   139.72   0.000     7.821152    8.045345
------------------------------------------------------------------------------

. 
. reg cases_log lagvacc_per lagvacc_per2 i.age i.week 

      Source |       SS           df       MS      Number of obs   =       198
-------------+----------------------------------   F(31, 166)      =    369.80
       Model |  237.047219        31  7.64668447   Prob > F        =    0.0000
    Residual |  3.43252999       166  .020677892   R-squared       =    0.9857
-------------+----------------------------------   Adj R-squared   =    0.9831
       Total |  240.479749       197  1.22070938   Root MSE        =     .1438

------------------------------------------------------------------------------
   cases_log |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 lagvacc_per |  -.0134144   .0036669    -3.66   0.000    -.0206542   -.0061746
lagvacc_per2 |   .0000967   .0000446     2.17   0.032     8.53e-06    .0001848
             |
         age |
      15-19  |   -.437979   .0433679   -10.10   0.000    -.5236027   -.3523553
      20-29  |  -.0233398   .0434865    -0.54   0.592    -.1091976    .0625181
      30-39  |  -.2922038   .0436402    -6.70   0.000    -.3783652   -.2060423
      40-49  |  -.3828524   .0440059    -8.70   0.000    -.4697358    -.295969
      50-59  |  -.6363954   .0445023   -14.30   0.000    -.7242589   -.5485319
      60-69  |  -.9975742   .0449908   -22.17   0.000    -1.086402   -.9087462
      70-79  |  -1.653272   .0449547   -36.78   0.000    -1.742028   -1.564515
        80+  |  -2.032193   .0448102   -45.35   0.000    -2.120664   -1.943722
             |
        week |
       3155  |   .3871146   .0677871     5.71   0.000     .2532787    .5209506
       3156  |   .6999702   .0677871    10.33   0.000     .5661343    .8338061
       3157  |   1.017811   .0677871    15.01   0.000     .8839751    1.151647
       3158  |   .9974344   .0677871    14.71   0.000     .8635984     1.13127
       3159  |   .6502206   .0677871     9.59   0.000     .5163846    .7840565
       3160  |  -.1001395   .0677871    -1.48   0.141    -.2339754    .0336964
       3161  |  -.7260257   .0677871   -10.71   0.000    -.8598616   -.5921898
       3162  |  -1.147822   .0677871   -16.93   0.000    -1.281658   -1.013986
       3163  |  -1.164281   .0677871   -17.18   0.000    -1.298117   -1.030445
       3164  |  -1.148024   .0677871   -16.94   0.000     -1.28186   -1.014188
       3165  |  -1.058696   .0677871   -15.62   0.000    -1.192532   -.9248597
       3166  |  -.8599854   .0677871   -12.69   0.000    -.9938213   -.7261495
       3167  |  -.4608992   .0677871    -6.80   0.000    -.5947352   -.3270633
       3168  |  -.1961716   .0677871    -2.89   0.004    -.3300075   -.0623357
       3169  |   .1670387   .0677871     2.46   0.015     .0332028    .3008746
       3170  |   .5429636   .0677871     8.01   0.000     .4091276    .6767995
       3171  |   .8499198   .0677871    12.54   0.000     .7160839    .9837558
       3172  |    1.24028   .0699162    17.74   0.000     1.102241     1.37832
       3173  |   1.490374   .0787203    18.93   0.000     1.334952    1.645796
       3174  |   1.363721   .0801763    17.01   0.000     1.205424    1.522018
       3175  |   1.249797   .0812206    15.39   0.000     1.089439    1.410156
             |
       _cons |   7.923674   .0563354   140.65   0.000     7.812447      8.0349
------------------------------------------------------------------------------

. 
. reg cases_log lagvacc_0_10 lagvacc_10_20 lagvacc_20_100 i.age i.week 

      Source |       SS           df       MS      Number of obs   =       198
-------------+----------------------------------   F(32, 165)      =    402.69
       Model |  237.439432        32  7.41998224   Prob > F        =    0.0000
    Residual |   3.0403171       165  .018426164   R-squared       =    0.9874
-------------+----------------------------------   Adj R-squared   =    0.9849
       Total |  240.479749       197  1.22070938   Root MSE        =    .13574

--------------------------------------------------------------------------------
     cases_log |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
  lagvacc_0_10 |  -.4550193   .0870872    -5.22   0.000    -.6269682   -.2830704
 lagvacc_10_20 |  -.5430955   .0926803    -5.86   0.000    -.7260877   -.3601034
lagvacc_20_100 |  -.6761747    .087064    -7.77   0.000    -.8480778   -.5042716
               |
           age |
        15-19  |  -.3588792   .0438842    -8.18   0.000    -.4455261   -.2722322
        20-29  |   .0466429   .0438842     1.06   0.289     -.040004    .1332899
        30-39  |  -.2207126   .0436532    -5.06   0.000    -.3069034   -.1345217
        40-49  |  -.3067294   .0434309    -7.06   0.000    -.3924813   -.2209774
        50-59  |  -.5753782   .0434309   -13.25   0.000    -.6611302   -.4896263
        60-69  |  -.9478091   .0436201   -21.73   0.000    -1.033935   -.8616835
        70-79  |  -1.606745   .0436201   -36.83   0.000    -1.692871    -1.52062
          80+  |  -1.983133   .0436201   -45.46   0.000    -2.069258   -1.897007
               |
          week |
         3155  |   .3871146   .0639899     6.05   0.000     .2607701    .5134591
         3156  |   .6999702   .0639899    10.94   0.000     .5736257    .8263147
         3157  |   1.017811   .0639899    15.91   0.000     .8914665    1.144155
         3158  |   .9974344   .0639899    15.59   0.000     .8710898    1.123779
         3159  |   .6502206   .0639899    10.16   0.000      .523876    .7765651
         3160  |  -.1001395   .0639899    -1.56   0.120     -.226484     .026205
         3161  |  -.7260257   .0639899   -11.35   0.000    -.8523702   -.5996812
         3162  |  -1.147822   .0639899   -17.94   0.000    -1.274166   -1.021477
         3163  |  -1.164281   .0639899   -18.19   0.000    -1.290625   -1.037936
         3164  |  -1.148024   .0639899   -17.94   0.000    -1.274369    -1.02168
         3165  |  -1.058696   .0639899   -16.54   0.000     -1.18504   -.9323511
         3166  |  -.8599854   .0639899   -13.44   0.000    -.9863299   -.7336409
         3167  |  -.4608992   .0639899    -7.20   0.000    -.5872438   -.3345547
         3168  |  -.1961716   .0639899    -3.07   0.003    -.3225161   -.0698271
         3169  |   .1670387   .0639899     2.61   0.010     .0406942    .2933832
         3170  |   .5429636   .0639899     8.49   0.000      .416619    .6693081
         3171  |   .8499198   .0639899    13.28   0.000     .7235753    .9762644
         3172  |   1.607354    .097773    16.44   0.000     1.414307    1.800402
         3173  |   1.792187   .0954109    18.78   0.000     1.603804    1.980571
         3174  |   1.651936   .0960867    17.19   0.000     1.462218    1.841654
         3175  |   1.522411   .0960867    15.84   0.000     1.332693    1.712129
               |
         _cons |   7.867777   .0543809   144.68   0.000     7.760405     7.97515
--------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  D:\UofT\Y2 Winter\ECO375\A1\ECO375_A1.log
  log type:  text
 closed on:  23 Feb 2021, 23:51:15
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
